Revit 2027 API
CableSize.NumberOfOtherConductors Property
 The number of Other Conductors.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfOtherConductors { get; set; }
Public Property NumberOfOtherConductors As Integer
	Get
	Set
public:
property int NumberOfOtherConductors {
	int get ();
	void set (int value);
}
member NumberOfOtherConductors : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for numberOfOtherConductors is negative.
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace